ДЗ: 
Написать программу в которой будет создан массив на n элементов. n - константа. Для примера задайте n = 50. Программа должна заполнить массив случайными числами в диапазоне (-100;100) и вывести его на экран. После этого она должна заменить знак у каждого элемента массива на противоположный и снова вывести массив на экран. 
Пример: 
Массив: 
-70 56 89 -3 4 
После замены: 
70 -56 -89 3 -4 
-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.
#include <iostream>
#include <ctime>

using namespace std;

int main()
{
	setlocale(LC_ALL,"Russian");  // локализация
	srand(time(NULL));
	const int n = 10;
	int array[n];
	cout << " До: " << endl;
	for (int i = 0; i < n; i++)  // рандомизация чисел и выведение массива
	{
		array[i] = rand() % 200 - 100; 
		cout << array[i] << endl;
	}
	cout << " После: " << endl;   // изменение знака и вывод массива
	for (int i = 0; i < n; i++)
	{
		array[i] = -array[i];
		cout << array[i] << endl;
	}
	system("pause");
	return 0;
}