ОБЯЗАТЕЛЬНОЕ ДЗ
На 1 балл:
Написать программу, которая выводит на экран 20 случайных чисел в диапазоне от -116 до 950
На 2 балла:
Дополнить эту программу таким образом, чтобы после вывода чисел она сообщала было ли среди выведенных чисел хоть одно отрицательное
--------------------------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <string>
#include <ctime>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	srand(time(NULL));
	int m = 0;
	for (int i = 0, n = 0; 20 > i; i = i + 1)
	{
		n = rand() % 1116 - 166;
		cout << n << endl;
		if (n < 0)
		{
			m = m + 1;
		}

	}
	if (m > 0)
	{
		cout << "Среди этих чисел есть " << m << " отрицительных чисел." << endl;
	}
	else
	{
		cout << "Среди этих чисел нет отрицательных." << endl;
	}
	system("pause");
}


